alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_spi.h
/*! @brief SPI delay time configure structure.*/
typedef struct _spi_delay_config
{
    uint8_t preDelay;      /*!< Delay between SSEL assertion and the beginning of transfer. */
    uint8_t postDelay;     /*!< Delay between the end of transfer and SSEL deassertion. */
    uint8_t frameDelay;    /*!< Delay between frame to frame. */
    uint8_t transferDelay; /*!< Delay between transfer to transfer. */
} spi_delay_config_t;

/*! @brief SPI master user configure structure.*/
typedef struct _spi_master_config
{
    bool enableLoopback;             /*!< Enable loopback for test purpose */
    bool enableMaster;               /*!< Enable SPI at initialization time */
    spi_clock_polarity_t polarity;   /*!< Clock polarity */
    spi_clock_phase_t phase;         /*!< Clock phase */
    spi_shift_direction_t direction; /*!< MSB or LSB */
    uint32_t baudRate_Bps;           /*!< Baud Rate for SPI in Hz */
    spi_data_width_t dataWidth;      /*!< Width of the data */
    spi_ssel_t sselNum;              /*!< Slave select number */
    spi_spol_t sselPol;              /*!< Configure active CS polarity */
    spi_fifo_config_t fifoConfig;    /*!< Configure for fifo. */
    spi_delay_config_t delayConfig;  /*!< Configure for delay time. */
} spi_master_config_t;

/*! @brief SPI slave user configure structure.*/
typedef struct _spi_slave_config
{
    bool enableSlave;                /*!< Enable SPI at initialization time */
    spi_clock_polarity_t polarity;   /*!< Clock polarity */
    spi_clock_phase_t phase;         /*!< Clock phase */
    spi_shift_direction_t direction; /*!< MSB or LSB */
    spi_data_width_t dataWidth;      /*!< Width of the data */
    spi_spol_t sselPol;              /*!< Configure active CS polarity */
    spi_fifo_config_t fifoConfig;    /*!< Configure for fifo. */
} spi_slave_config_t;

/*! @brief SPI transfer status.*/
enum _spi_status
{
    kStatus_SPI_Busy = MAKE_STATUS(kStatusGroup_LPC_SPI, 0),  /*!< SPI bus is busy */
    kStatus_SPI_Idle = MAKE_STATUS(kStatusGroup_LPC_SPI, 1),  /*!< SPI is idle */
    kStatus_SPI_Error = MAKE_STATUS(kStatusGroup_LPC_SPI, 2), /*!< SPI  error */
    kStatus_SPI_BaudrateNotSupport =
        MAKE_STATUS(kStatusGroup_LPC_SPI, 3) /*!< Baudrate is not support in current clock source */
};

/*! @brief SPI interrupt sources.*/
enum _spi_interrupt_enable
{
    kSPI_RxReadyInterruptEnable = SPI_INTENSET_RXRDYEN_MASK,           /*!< Rx ready interrupt */
    kSPI_TxReadyInterruptEnable = SPI_INTENSET_TXRDYEN_MASK,           /*!< Tx ready interrupt */
    kSPI_RxOverrunInterruptEnable = SPI_INTENSET_RXOVEN_MASK,          /*!< Rx overrun interrupt */
    kSPI_TxUnderrunInterruptEnable = SPI_INTENSET_TXUREN_MASK,         /*!< Tx underrun interrupt */
    kSPI_SlaveSelectAssertInterruptEnable = SPI_INTENSET_SSAEN_MASK,   /*!< Slave select assert interrupt */
    kSPI_SlaveSelectDeassertInterruptEnable = SPI_INTENSET_SSDEN_MASK, /*!< Slave select deassert interrupt */
    kSPI_MasterIdleInterruptEnable = SPI_INTENSET_MSTIDLEEN_MASK,      /*!< Master idle interrupt */
    kSPI_AllInterruptEnable =
        (SPI_INTENSET_RXRDYEN_MASK | SPI_INTENSET_TXRDYEN_MASK | SPI_INTENSET_RXOVEN_MASK | SPI_INTENSET_TXUREN_MASK |
         SPI_INTENSET_SSAEN_MASK | SPI_INTENSET_SSDEN_MASK | SPI_INTENSET_MSTIDLEEN_MASK)
};

/*! @brief SPI FIFO interrupt sources.*/
enum _spi_fifo_interrupt_enable
{
    kSPI_RxFifoThresholdInterruptEnable =
        VFIFO_SPI_CTLSETSPI_RXTHINTEN_MASK, /*!< Rx FIFO reach the threshold interrupt */
    kSPI_TxFifoThresholdInterruptEnable =
        VFIFO_SPI_CTLSETSPI_TXTHINTEN_MASK, /*!< Tx FIFO reach the threshold interrupt */
    kSPI_RxFifoTimeoutInterruptEnable = VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_MASK, /*!< Rx FIfo timeout interrupt */
    kSPI_AllFifoInterruptEnable = (VFIFO_SPI_CTLSETSPI_RXTHINTEN_MASK | VFIFO_SPI_CTLSETSPI_TXTHINTEN_MASK |
                                   VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_MASK)
};

/*! @brief SPI status flags.*/
enum _spi_status_flags
{
    kSPI_RxReadyFlag = SPI_STAT_RXRDY_MASK,           /*!< Receive ready flag. */
    kSPI_TxReadyFlag = SPI_STAT_TXRDY_MASK,           /*!< Transmit ready flag. */
    kSPI_RxOverrunFlag = SPI_STAT_RXOV_MASK,          /*!< Receive overrun flag. */
    kSPI_TxUnderrunFlag = SPI_STAT_TXUR_MASK,         /*!< Transmit underrun flag. */
    kSPI_SlaveSelectAssertFlag = SPI_STAT_SSA_MASK,   /*!< Slave select assert flag. */
    kSPI_SlaveSelectDeassertFlag = SPI_STAT_SSD_MASK, /*!< slave select deassert flag. */
    kSPI_StallFlag = SPI_STAT_STALLED_MASK,           /*!< Stall flag. */
    kSPI_EndTransferFlag = SPI_STAT_ENDTRANSFER_MASK, /*!< End transfer bit. */
    kSPI_MasterIdleFlag = SPI_STAT_MSTIDLE_MASK,      /*!< Master in idle status flag. */
};

/*! @brief SPI FIFO status flags.*/
enum _spi_fifo_status_flags
{
    kSPI_RxFifoThresholdFlag = (VFIFO_SPI_STATSPI_RXTH_MASK),    /*!< Receive FIFO threshold reached flag. */
    kSPI_TxFifoThresholdFlag = (VFIFO_SPI_STATSPI_TXTH_MASK),    /*!< Transmit FIFO threshold reached flag. */
    kSPI_RxFifoTimeOutFlag = (VFIFO_SPI_STATSPI_RXTIMEOUT_MASK), /*!< Receive time out flag. */
    kSPI_FifoBusErrorFlag = (VFIFO_SPI_STATSPI_BUSERR_MASK),     /*!< FIFO bus error flag. */
    kSPI_RxFifoEmptyFlag = (VFIFO_SPI_STATSPI_RXEMPTY_MASK),     /*!< Receive fifo buffer empty flag. */
    kSPI_TxFifoEmptyFlag = (VFIFO_SPI_STATSPI_TXEMPTY_MASK),     /*!< transmit fifo buffer empty flag. */
};

/*! @brief SPI transfer structure */
typedef struct _spi_transfer
{
    uint8_t *txData;      /*!< Send buffer */
    uint8_t *rxData;      /*!< Receive buffer */
    uint32_t configFlags; /*!< Additional option to control transfer */
    size_t dataSize;      /*!< Transfer bytes */
} spi_transfer_t;

/*! @brief SPI half-duplex(master only) transfer structure */
typedef struct _spi_half_duplex_transfer
{
    uint8_t *txData;            /*!< Send buffer */
    uint8_t *rxData;            /*!< Receive buffer */
    size_t txDataSize;          /*!< Transfer bytes for transmit */
    size_t rxDataSize;          /*!< Transfer bytes */
    uint32_t configFlags;       /*!< Transfer configuration flags; set from _dspi_transfer_config_flag_for_master. */
    bool isPcsAssertInTransfer; /*!< If Pcs pin keep assert between transmit and receive. true for assert and false for
                                   deassert. */
    bool isTransmitFirst;       /*!< True for transmit first and false for receive first. */
} spi_half_duplex_transfer_t;

/*! @brief Internal configuration structure used in 'spi' and 'spi_dma' driver */
typedef struct _spi_config
{
    spi_data_width_t dataWidth;
    spi_ssel_t sselNum;
} spi_config_tt;

